ej_blog_form2/app/controllers/blog_controller.rb

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hi"], ["content", "My name is erica"], ["created_at", "2020-08-04 22:53:37.414241"], ["updated_at", "2020-08-04 22:53:37.414241"]]
---
    def create
        @blog = Blog.create(blog_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 11]]
---
    def delete
        @blog = Blog.find(params[:id])
        if @blog.destroy